#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_vpc.default_vpc: Reading...
data.aws_subnet.subnet_us-east-1a: Reading...
data.aws_subnet.subnet_us-east-1b: Reading...
aws_vpc.gl_vpc: Refreshing state... [id=vpc-04951f0170fd08dc0]
aws_security_group.securitygrp1: Refreshing state... [id=sg-008cfff7766ed6cb7]
data.aws_subnet.subnet_us-east-1b: Read complete after 0s [id=subnet-0893f1760ba7fe0c3]
data.aws_subnet.subnet_us-east-1a: Read complete after 0s [id=subnet-0275b87dfa0212136]
aws_lb.load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:loadbalancer/app/web-lb/11a3268a864e33ab]
data.aws_vpc.default_vpc: Read complete after 0s [id=vpc-0296796e930d1a837]
aws_lb_target_group.academy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:listener/app/web-lb/11a3268a864e33ab/5cf4840dd8c28af4]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0fa9bc89bb6b92fd1]
aws_subnet.private_subnet: Refreshing state... [id=subnet-0965e19f45cdc7622]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0d93e21193d462bca]
aws_internet_gateway.gl_igw: Refreshing state... [id=igw-013a5ef1412f76a9c]
aws_security_group.public_sg: Refreshing state... [id=sg-0edb6d6e8d33f1da2]
aws_lb_listener_rule.instances: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:758836510411:listener-rule/app/web-lb/11a3268a864e33ab/5cf4840dd8c28af4/fe7f4db65e974d47]
aws_route.public_route: Refreshing state... [id=r-rtb-0fa9bc89bb6b92fd11080289494]
aws_route_table_association.public_subnet_association: Refreshing state... [id=rtbassoc-07b4949d6e401d294]
aws_security_group.private_sg: Refreshing state... [id=sg-0e285dfe8cc47c47b]
aws_instance.public_instance: Refreshing state... [id=i-0e505252116011475]
aws_instance.private_instance: Refreshing state... [id=i-0be01b0550d45d5af]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.academy_instance1 will be created
  + resource "aws_instance" "academy_instance1" {
      + ami                                  = "ami-00588af4e4d549f20"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "pgpcc-key1"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0275b87dfa0212136"
      + tags                                 = {
          + "name" = "httpserver1"
        }
      + tags_all                             = {
          + "name" = "httpserver1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b8bb4ec116f99a0587f9ae442d3c7d21ffc825a3"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.academy_instance2 will be created
  + resource "aws_instance" "academy_instance2" {
      + ami                                  = "ami-00588af4e4d549f20"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "pgpcc-key1"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0893f1760ba7fe0c3"
      + tags                                 = {
          + "name" = "httpserver2"
        }
      + tags_all                             = {
          + "name" = "httpserver2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4b364ca8759861bb4c61863a37285502917041e0"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb.load_balancer will be updated in-place
  ~ resource "aws_lb" "load_balancer" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:758836510411:loadbalancer/app/web-lb/11a3268a864e33ab"
        name                                        = "web-lb"
      ~ security_groups                             = [
          - "sg-008cfff7766ed6cb7",
        ] -> (known after apply)
        tags                                        = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group_attachment.academy_tg_attach1 will be created
  + resource "aws_lb_target_group_attachment" "academy_tg_attach1" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.academy_tg_attach2 will be created
  + resource "aws_lb_target_group_attachment" "academy_tg_attach2" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:758836510411:targetgroup/web-tg/5ec9bdd67038cc15"
      + target_id        = (known after apply)
    }

  # aws_security_group.securitygrp1 must be replaced
-/+ resource "aws_security_group" "securitygrp1" {
      ~ arn                    = "arn:aws:ec2:us-east-1:758836510411:security-group/sg-008cfff7766ed6cb7" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-008cfff7766ed6cb7" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "private-sg" -> "private-sg1" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "758836510411" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-0296796e930d1a837" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.allow_alb_all_outbound will be created
  + resource "aws_security_group_rule" "allow_alb_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_alb_http_inbound will be created
  + resource "aws_security_group_rule" "allow_alb_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_http_inbound will be created
  + resource "aws_security_group_rule" "allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.ssh-rule will be created
  + resource "aws_security_group_rule" "ssh-rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 9 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gracemade21, Action: `pull_request`*